""" Напишите функцию add , которая принимает два числа и возвращает их сумму.
Затем вызовите функцию с разными аргументами и выведите результат
"""

def add(a, b):
    return a + b

result1 = add(5, 3)
result2 = add(7, 2)

print(result1)
print(result2)